Repository: wennndy47/LinuxAppDevelopment25
Catalog: 12_InstallPackaging_1/po/*.po
Languages: ru

source: Hangman Game version %s
ru: Версия игры Виселица %s

source: Usage: hangman [OPTION]
ru: Использование: hangman [ОПЦИИ]

source: Word guessing game.
ru: Игра в угадывание слов.

source: Options:
ru: Опции:

source: -h, --help display this help and exit
ru: -h, --help вывести эту помощь и завершить работу

source: -v, --version display version information and exit
ru: -v, --version вывести версию и завершить работу

source: -l, --language LANG set game language (en, ru)
ru: -l, --language LANG установить язык игры (en, ru)

source: -d, --data-dit DATA_DIR set directory containing word lists (en, ru)
ru: -d, --data-dit DATA_DIR установить папку со списком слов (en, ru)

source: Environment variables:
ru: Переменные окружения:

source: LANG determines interface language
ru: LANG определяет язык интерфейса

source: DATA_DIR determines directory with word lists
ru: DATA_DIR установка папки со списком слов

source: Examples:
ru: Примеры:

source: hangman start game with default language
ru: hangman начинает игру с языком по умолчанию

source: hangman --language ru start game in Russian
ru: hangman --language ru начинает игру на русском

source: LANG=ru_RU.UTF-8 hangman alternative way to set language
ru: LANG=ru_RU.UTF-8 hangman альтернативный способ задать язык

source: Report bugs to: <me@me.com>
ru: Сообщать о багах: <me@me.com>

source: Failed to determine data directory
ru: Ошибка в определении директории со списком слов

source: Data directory does not exist: %s
ru: Директория со списком слов не существует: %s

source: Failed to construct wordlist path
ru: Ошибка в конструировании пути к списку слов.

source: Failed to get a word from wordlist.
ru: Ошибка в получении слова из списка слов.

source: Word: %s
ru: Слово: %s

source: Tries left: %d
ru: Осталось попыток: %d

source: Guessed letters: %s
ru: Буквы: %s

source: Welcome to Hangman!
ru: Добро пожаловать в Виселицу!

source: Failed to create game
ru: Ошибка в создании игры

source: Failed to load word
ru: Ошибка в загрузке слова

source: Guess a letter:
ru: Угадайте букву:

source: Please enter a valid letter
ru: Пожалуйста, введите букву

source: Congratulations! You won!
ru: Поздравляем! Вы победили!

source: The word was: %s
ru: Загаданное слово: %s

source: Game over! You lost.
ru: Игра завершена! Вы проиграли.

source: Try 'hangman --help' for more information.
ru: Попробуйте 'hangman --help' чтобы узнать больше.
